from datetime import datetime
import random

import miraicle
from bots.mirai.connect import *

@miraicle.scheduled_job(miraicle.Scheduler.every().hour.at("00:00:00"))
def water(bot: miraicle.Mirai):

    current = datetime.now()

    hr = current.hour

    hr_to_chi_dict = {
        0: "半夜十二点",
        1: "凌晨一点",
        2: "凌晨两点",
        3: "凌晨三点",
        4: "凌晨四点",
        5: "早上五点",
        6: "早上六点",
        7: "早上七点",
        8: "早上八点",
        9: "上午九点",
        10: "上午十点",
        11: "上午十一点",
        12: "中午十二点",
        13: "下午一点",
        14: "下午两点",
        15: "下午三点",
        16: "下午四点",
        17: "下午五点",
        18: "下午六点",
        19: "晚上七点",
        20: "晚上八点",
        21: "晚上九点",
        22: "晚上十点",
        23: "晚上十一点",
    }

    prompts = {
        0: [
            "新的一天到了。不过我觉得你其实应该去睡觉才对。",
            f"现在已经是{current.day}号啦！所以你怎么还没睡？",
            "十二点了！我知道你们肯定没睡但是，我至少得试试，所以，你们要不要考虑现在去...睡觉？"
        ],
        1: [
            "（小小毛龙已经困了。）",
            "（你看见小小毛龙闭上了眼睛，然后又强撑着睁开眼睛打了个哈欠。）",
            "一点了诶...你怎么还不睡？"
        ],
        2: [
            "两点了，小小毛龙也要休息了。你为什么还没睡？",
            "比起喝水，我觉得差不多该去睡觉了...晚安！",
            "我知道也许你还不困，但这个点了，有什么事情还是明天再说吧。",
            "（你看见小小毛龙闭着眼趴在地上，发出了几声轻轻的咕噜声，大概是快睡着了。）"
        ],
        8: [
            f"早上好！现在是{current.year}年{current.month}月{current.day}号的早上八点，天气你自己往窗外瞅吧，我不知道。",
            "早！不过现在这个点真的有人么？虽然是早上八点但是你们真的有人在吗？哈喽？",
            "小毛龙叫我早上八点的时候来群里吱一声。不过说实话我没太睡醒，现在是八点么？你说你是香菇狐狸？那没事了",
            "八点了！今天有好好吃早餐吗？不吃早餐的话，吃老子一拳"
        ],
        12: [
            "该吃饭了，朋友。我是说你的午饭，不是早饭。",
            "你应该考虑一下你今天的200+g碳水化合物, 70+g蛋白质以及50-g脂肪要从哪里来了,朋友。",
            "让我来看看谁今天凌晨两点买一堆夜宵，然后到现在都不打算吃饭..."
        ],
        18: [
            "我觉得现在是个喝水的好时机。顺便可以想想你今天晚上打算吃什么。",
            "下午六点，快晚上了。晚饭吃什么你有什么头猪吗？",
            "我知道你也许大概很有可能还没下班，但是其实这个时候差不多该吃晚饭了。不如立刻开始打开外卖软件摸鱼。",
        ],
        23: [
            f"十一点了！虽然理论上这个时候我该建议你们睡觉了，但是群里的狒批也许需要打新一天的cd......嘛。你看着办咯",
            "我专门为这个时间写了个特殊的提醒事项，你不妨猜猜我想说什么。",
            "FF14的每日CD刷新了。以及也许你想检查一下现在是不是有什么活动在开，我不知道，但是我觉得我们这里有侠客。"
        ]
    }

    generic_prompts = [
        [range(9, 24), f"{hr_to_chi_dict[hr]}了。起来稍微活动下怎么样？"],
        [range(9, 21), "又一个小时过去了。小小毛龙建议你少水会群，多喝点水。不如现在就去干个300ml。"],
        [range(9, 21), "你知道吗？大多数医学指南推荐你每天摄入2000ml以上的水，以及0ml的无糖可乐。已经一个小时了，喝点水吧。可乐可以给我喝。"],
        [range(9, 21), f"现在是{hr_to_chi_dict[hr]}整。我又来叫你们喝水了。回复TD也不能退订。"],
        [range(9, 24), "又到整点了。你知道我是来喊你做啥的。不过其实除了喝水之外你也可以考虑做点别的，像是起来走走，可以防止血栓冒出来干你。"],
        [range(9, 21), "（小小毛龙打了个呵欠，然后在你面前晃了晃一个空着的水杯。）"],
        [range(9, 21), "🥤 ← 这是一个神秘的emoji，你猜猜看我想表达什么意思"],
        [range(10, 21),"乐观主义者说瓶子是半满的，悲观主义者说瓶子是半空的，而我只是想跟你讲又一个小时过去了，你能不能把这剩下半瓶水喝完？"],
        [range(11, 24), f"{hr_to_chi_dict[hr]}。虽然我只是叫你来喝水的，但是一信说你也可以提肛。为什么要提肛？你问他去，我不知道。"],
        [range(11, 24), f"{hr_to_chi_dict[hr]}。虽然一信只是叫你来提肛的，但是我说你也可以喝水。为什么要提肛？你问他去，我不知道。"]
    ]

    if hr in range(3, 8):
        pass
    else:
        if hr in prompts.keys():
            message = random.choice(prompts[hr])
        else:
            message_struct = random.choice(generic_prompts)
            while hr not in message_struct[0]:
                message_struct = random.choice(generic_prompts)

            message = message_struct[1]

        bot.send_group_msg(group = 484597471, 
                        msg = message)